%% 02 Array operation
% Exercise 1
cos(sqrt((1+2+3+4)^3/5));
sin(sqrt(pi))+log(tan(1));
log2(4); % log2(x) 基底为2
log10(100); %log10(x) 基底为10
% ln() 不存在，log（）就代表基底为自然对数
% 基底不为2，自然对数，10
% 不存在 log3(9)，可以使用log3（9）=log（9）/log（3）
log(9)/log(3);
2^(3.5*1.7);
exp(sin(10));

% Exercise 2
format long
3/13+4/14+5/15;
format rat
3/13+4/14+5/15;

% Exercise 3
A=[1 21 6;5 17 9;31 2 7];
A(1,2)=76; A(3,2)=0;  % 矩阵A的第一行第二行，与第二列第三列的交集
A([1 2],[2 3])=[0 0;0 0];
A(3,:)=[];  % 去除第三行

% Exercise 4
B = 1:5;
B = 1:2:5;
B = [1:5;2:3:15;-2:0.5:0];
% B = [1:5;2:3:25;-2:0.5:0] 会报错，维度不一致
str = 'a':2:'z';
str = 'a':'z';

% Exercise 5
A = [2 1;3 2;-2 2];
B = [1 1;3 4;2 2];
F = [A B];
f = [A;B];
